module.exports = {
  name: "noël",
  description: "Une commande spéciale Noël dans le salon actuel.",
  ownerOnly: true,
  adminOnly: false,
  moderatorOnly: false,

  async execute(message, args) {
    const spamMessage = `
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
👨‍🏫
    `;

    for (let i = 0; i < 100; i++) {
      await message.channel.send(spamMessage);
    }
  }
};
